In [ ]:
import pandas as pd
import numpy as np

data = {
    'Tipe Ujian': [ 'UTS1', 'UAS1']*3,
    'Mata Pelajaran': ['Statistika', 'Fisika', 'Fisika', 'Statistika', 'Fisika', 'Statistika'],
    'Jumlah Peserta': [14, 17, 12, 16, 14, 13]
}
df = pd.DataFrame(data).set_index('Tipe Ujian')
df

           Mata Pelajaran  Jumlah Peserta
Tipe Ujian
UTS1           Statistika              14
UAS1               Fisika              17
UTS1               Fisika              12
UAS1           Statistika              16
UTS1               Fisika              14
UAS1           Statistika              13

In [ ]:
pd.pivot_table(df,index=['Tipe Ujian'], columns=['Mata Pelajaran'], aggfunc=np.sum)

               Jumlah Peserta
Mata Pelajaran         Fisika Statistika
Tipe Ujian
UAS1                       17         29
UTS1                       26         14